from dataclasses import dataclass, field
import json
from pathlib import Path

@dataclass
class Rule:
    category: str
    keywords: list = field(default_factory=list)
    from_contains: list = field(default_factory=list)
    priority: int = 1000

    def match(self, email):
        text = email.topic.lower()+email.text.lower()  
        for i in self.keywords:
            if i.lower() in text:
                return True
            
        if email.sender:
            sender = email.sender.lower()
            for j in self.from_contains:
                if j.lower() in sender:
                    return True   
                  
        return False
    
    @classmethod
    def new_rule(cls, inf):
        return cls(
            category=inf["category"],
            keywords=inf.get("keywords", []),
            from_contains=inf.get("from_contains", []),
            priority=inf.get("priority", 100)
        )

class EmailClassifier:
    def __init__(self, rules=None):
        if rules is None:
            rules = self.get_rules()
        self.rules = sorted(rules, key=lambda x: x.priority)
        self.default_category = "неотсортированное"
    
    def get_rules(self):
        return [
                Rule(
                category="спам, фишинг, вредоносные",
                priority=5,
                keywords=[
                    "спам", "phishing", "вредоносное по", "мошенничество", "фишинг", 
                    "лотерея", "заработок", "криптовалюта", "письмо от принца", "malware", 
                    "троян", "казино", "кредит", "быстрые деньги", "финансовая пирамида",
                    "пароль истекает", "верификация аккаунта", "подтвердите личность",
                    "подозрительный вход", "заблокирован счет", "аккаунт будет заблокирован",
                    "установить новый клиент", "данные банковской карты", "выиграли iphone",
                    "эксклюзивная акция", "приз", "розыгрыш",
                    "secure-login-verify", "totally-not-spam", "cdn-service.net"
                    ],
                from_contains=["@spam", "newsletter@", "promo@", "noreply-marketing@"]
                ),
                Rule(
                    category="технические сбои и проблемы ПО",
                    priority=10,
                    keywords=[
                        "сбой", "авария", "не работает", "critical", "outage", "down", "остановка", "простой", 
                        "инцидент", "sev0", "sev1", "падает", "недоступен", "не загружается", "красный", 
                        "срочно", "аварийный", "поломка", "отказ", "ошибка 500", "не отвечает", "лежит", 
                        "катастрофа", "блокировка системы", "ошибка", "баг", "сбой по", "программа", 
                        "приложение", "софт", "не работает программа", "вылетает", "зависает", "ошибка в модуле", 
                        "интерфейс", "функционал", "глюк", "вылет", "падение", "краш", "дефект", "некорректно", 
                        "не обновляется", "установка", "лицензия по", "версия", "совместимость", "зависло", 
                        "тупит", "простой системы", "отвалился", "упал", "сломалось", "bug", "crash", 
                        "exception", "traceback", "утечка памяти", "некорректно работает", "502 bad gateway", 
                        "503 service unavailable", "таймаут", "timeout", "404 not found", "проблема с лицензией", 
                        "база лежит", "бд не отвечает", "неисправность", "ремонт", "не включается", "перезагруз", 
                        "перестал работать", "оборудовани", "проблема с", "не определяется", "замен", "диагностик", 
                        "не открывает", "после обновления", "alert", "healthcheck", "err_"
                    ]
                ),
                Rule(
                    category="доступы, права, учетные записи",
                    priority=20,
                    keywords=[
                        "доступ", "права", "логин", "пароль", "учетная запись", "аккаунт", "роль", "разрешение", 
                        "авторизация", "аутентификация", "смена пароля", "заблокирован", "разблокировать", 
                        "вход", "войти", "не могу войти", "доступа нет", "нет прав", "ограничение доступа", 
                        "2fa", "мфа", "токен", "сессия", "учетка", "логин/пароль", "учетн", "сброс пароля", 
                        "сменить пароль", "vpn", "впн", "доступ к", "выдать права", "настроить доступ", 
                        "удаленный доступ", "mfa", "авторизац", "аутентификац"
                    ]
                ),
                Rule(
                    category="документы, бухгалтерия, юридические запросы",
                    priority=30,
                    keywords=[
                        "документ", "счет", "накладная", "акт", "договор", "бухгалтерия", "налог", "юрист", 
                        "юридический", "запрос", "фнс", "отчетность", "счёт-фактура", "первичная документация", 
                        "акт сверки", "платеж", "инвойс", "бухгалтер", "бух.отчетность", "налоговая", "правовой", 
                        "юридическое лицо", "подпись", "электронная подпись", "эдо", "архив документов", "сканы", 
                        "копия", "оригинал", "счет-фактур", "ндс", "зарплат", "отпускные", "первичк", "контракт", 
                        "соглашение", "иск", "претензи", "юридическ", "доверенност", "эцп", "скан паспорта", "реквизиты",
                        "больничн", "отпуск", "согласовать", "график работы"
                    ]
                ),
                Rule(
                    category="прочие запросы и уведомления",
                    priority=40,
                    keywords=[
                        "информация", "уведомление", "новость", "опрос", "благодарность", "запрос информации", 
                        "разъяснение", "консультация", "как сделать", "подскажите", "интересно", "возможно ли", 
                        "пример", "обучение", "вебинар", "презентация", "новости", "дайджест", "поздравление", 
                        "справка", "вопрос", "обратная связь", "бюллетень", "newsletter", "подскажите, как", 
                        "инструкци", "обучени", "тренинг", "корпоратив", "поздравляем", "созвон", "демо", 
                        "встретиться", "обсудить", "приглаша", "приглашени"
                    ]
                )
        ]
    
    def classify(self, email):
        for rule in self.rules:
            if rule.match(email):
                return rule.category
        return self.default_category
    
    
    def add_rules(self, filepath):
        with open(filepath, 'r', encoding='utf-8') as f:
            inf = json.load(f)
        new_rules = [Rule.new_rule(i) for i in inf.get("rules", [])]
        self.rules.extend(new_rules)
        self.rules.sort(key=lambda x: x.priority)
